delete-items

In [1]:
import pandas as pd

In [2]:
data = {
    'city' : ['Toronto', 'Montreal', 'Waterloo'],
    'points' : [80, 70, 90]
}

In [3]:
data

{'city': ['Toronto', 'Montreal', 'Waterloo'], 'points': [80, 70, 90]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

       city  points
0   Toronto      80
1  Montreal      70
2  Waterloo      90

In [7]:
#delete column
df1 = df.drop('points', axis = 1)

In [8]:
df1

       city
0   Toronto
1  Montreal
2  Waterloo

In [9]:
#delete row
df2 = df.drop(1)

In [10]:
df2

       city  points
0   Toronto      80
2  Waterloo      90

In [18]:
df3 = df[df['points'] < 90]

In [19]:
df3

       city  points
0   Toronto      80
1  Montreal      70